
find_country_L_N(M,N):-страна_озеро(M,N).

find_country_L_D(M,Min,Max):-страна_озеро(M,N),
                             глубина_озера(N,S),
                             S>Min,S<Max.

find_country_R_N(M,N):-страна_река(M,N).

find_country_R_L(M,Min,Max):-длина_реки(N,S),
                             S>Min,S<Max,
                             страна_река(M,N).


find_country_C_S(M,Min,Max):-страна_площадь(M,S),
                             S<Max,S>Min.

find_river_C_N(M,N):-страна_река(N,M).

find_river_C_S(M,Min,Max):-страна_площадь(N,S),
                           S<Max,S>Min,
                           страна_река(N,M).

find_river_R_L(M,Min,Max):-длина_реки(M,S),
                           S<Max,S>Min.

find_river_L_N(M,N):-страна_озеро(F,N),страна_река(F,M).

find_river_L_D(M,Min,Max):-глубина_озера(N,S),
                           S<Max,S>Min,
                           страна_озеро(F,N),
                           страна_река(F,M).

find_lake_C_N(M,N):-страна_озеро(N,M).

find_lake_C_S(M,Min,Max):-страна_площадь(N,S),
                          S<Max,S>Min,
                          страна_озеро(N,M).

find_lake_L_D(M,Min,Max):-глубина_озера(M,S),
                          S<Max,S>Min.

find_lake_R_N(M,N):-страна_река(F,N),
                    страна_озеро(F,M).

find_lake_R_L(M,Min,Max):-длина_реки(N,S),
                          S<Max,S>Min,
                          страна_река(F,N),
                          страна_озеро(F,M).
страна(россия).
страна(сша).
страна(китай).
страна(япония).
страна(бразилия).

озеро(байкал).
озеро(ладожское).
озеро(мичиган).
озеро(гурон).
озеро(тайху).
озеро(поянху).
озеро(бива).
озеро(товада).
озеро(подземное).
озеро(лагоа).

река(волга).
река(ока).
река(миссури).
река(колорадо).
река(хуанхэ).
река(чжуцзян).
река(абукума).
река(го).
река(амазонка).
река(парана).

страна_площадь(россия,15000).
страна_площадь(сша,9629).
страна_площадь(китай,9600).
страна_площадь(япония,377).
страна_площадь(бразилия,8515).

страна_река(россия,волга).
страна_река(россия,ока).
страна_река(сша,миссури).
страна_река(сша,колорадо).
страна_река(китай,хуанхэ).
страна_река(китай,чжуцзян).
страна_река(япония,абукума).
страна_река(япония,го).
страна_река(бразилия,амазонка).
страна_река(бразилия,парана).

длина_реки(волга,3530).
длина_реки(ока,1500).
длина_реки(миссури,3767).
длина_реки(колорадо,2334).
длина_реки(хуанхэ,5464).
длина_реки(чжуцзян,2200).
длина_реки(абукума,239).
длина_реки(го,194).
длина_реки(амазонка,6992).
длина_реки(парана,4380).

страна_озеро(россия,байкал).
страна_озеро(россия,ладожское).
страна_озеро(сша,мичиган).
страна_озеро(сша,гурон).
страна_озеро(китай,тайху).
страна_озеро(китай,поянху).
страна_озеро(япония,бива).
страна_озеро(япония,товада).
страна_озеро(бразилия,подземное).
страна_озеро(бразилия,лагоа).


глубина_озера(байкал,1642).
глубина_озера(ладожское,230).
глубина_озера(мичиган,281).
глубина_озера(гурон,229).
глубина_озера(тайху,3).
глубина_озера(поянху,20).
глубина_озера(бива,104).
глубина_озера(товада,327).
глубина_озера(подземное,90).
глубина_озера(лагоа,30).


справка:-
    write("Буква ""a"" для вывода всего"),nl,
    write("Буква ""b"" - поиск страны по названию озера"),nl,
    write("Буква ""с"" - поиск страны по глубине озера в пределах: (min,max)"),nl,
    write("Буква ""d"" - поиск страны по названию реки"),nl,
    write("Буква ""e"" - поиск страны по длине реки в пределах: (min,max)"),nl,
    write("Буква ""f"" - поиск страны по площади страны в пределах: (min,max)"),nl,
    write("Буква ""g"" - поиск реки по названию страны"),nl,
    write("Буква ""h"" - поиск реки по площади страны в пределах: (min,max)"),nl,
    write("Буква ""i"" - поиск реки по длине реки в пределах: (min,max)"),nl,
    write("Буква ""j"" - поиск реки по названию озера"),nl,
    write("Буква ""k"" - поиск реки по глубине озера в пределах: (min,max)"),nl,
    write("Буква ""l"" - поиск озера по названию страны"),nl,
    write("Буква ""m"" - поиск озера по площади страны в пределах: (min,max)"),nl,
    write("Буква ""n"" - поиск озера по глубине озера в пределах: (min,max)"),nl,
    write("Буква ""o"" - поиск озера по названию реки"),nl,
    write("Буква ""p"" - поиск озера по длине реки в пределах: (min,max)"),nl,

    write("Буква ""r"" - cводная информация о стране по ее названию"),nl,
    write("Буква ""s"" - cводная информация о реке по ее названию"),nl,
    write("Буква ""t"" - cводная информация об озере по его названию"),nl.

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
a:-write("Вывод всего"),nl,nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~w~w~w~w~60|~n~n',
          ['Страна','(','площадь',')',
           'Река','(','длина',')',
           'Озеро','(','глубина',')']),

   tell('text.txt'),
    format('~w~w~w~w~20|~w~w~w~w~40|~w~w~w~w~60|~n~n',
           ['Страна','(','площадь',')',
            'Река','(','длина',')',
            'Озеро','(','глубина',')']),
   tell(user),

    страна(C_N),
    страна_площадь(C_N,C_S),
    страна_река(C_N,R_N),
    длина_реки(R_N,R_L),
    страна_озеро(C_N,L_N),
    глубина_озера(L_N,L_D),
                           format('~w~w~w~w~20|~w~w~w~w~40|~w~w~w~w~60|~n',
                              [C_N,'(',C_S,')',
                               R_N,'(',R_L,')',
                               L_N,'(',L_D,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~w~w~w~w~40|~w~w~w~w~60|~n',
                              [C_N,'(',C_S,')',
                               R_N,'(',R_L,')',
                               L_N,'(',L_D,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

b:-write("Поиск страны по названию озера"),nl,
   write("Введите название озера: "),nl,
   read(L_N),nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Озеро','(','глубина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Озеро','(','глубина',')']),
   tell(user),

    find_country_L_N(C_N,L_N),
    страна_площадь(C_N,C_S),
    глубина_озера(L_N,L_D),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
                                  [C_N,'(',C_S,')',
                                   L_N,'(',L_D,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
                                  [C_N,'(',C_S,')',
                                   L_N,'(',L_D,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
c:-write("Поиск страны по глубине озера в пределах: (min,max)"),nl,
   write("Введите минимальную глубину озера: "),nl,
   read(Min),
   write("Введите максимальную глубину озера: "),nl,
   read(Max),nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Озеро','(','глубина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Озеро','(','глубина',')']),
   tell(user),

    find_lake_L_D(L_N,Min,Max),
    глубина_озера(L_N,L_D),
    страна_озеро(C_N,L_N),
    страна_площадь(C_N,C_S),

                            format('~w~w~w~w~20|~w~w~w~w~40|~n',
                                  [C_N,'(',C_S,')',
                                   L_N,'(',L_D,')']),

                           tell('text.txt'),
                            format('~w~w~w~w~20|~w~w~w~w~40|~n',
                                  [C_N,'(',C_S,')',
                                   L_N,'(',L_D,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
d:-write("Поиск страны по названию реки"),nl,
   write("Введите название реки: "),nl,
   read(R_N),nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Река','(','длина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Река','(','длина',')']),
   tell(user),

    find_country_R_N(C_N,R_N),
    страна_площадь(C_N,C_S),
    длина_реки(R_N,R_L),

                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [C_N,'(',C_S,')',
           R_N,'(',R_L,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [C_N,'(',C_S,')',
           R_N,'(',R_L,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
e:-write("Поиск страны по длине реки в пределах: (min,max)"),nl,
   write("Введите минимальную длину реки: "),nl,
   read(Min),nl,
   write("Введите максимальную длину реки: "),nl,
   read(Max),nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Река','(','длина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Река','(','длина',')']),
   tell(user),

    find_river_R_L(R_N,Min,Max),
    длина_реки(R_N,R_L),
    страна_река(C_N,R_N),
    страна_площадь(C_N,C_S),

                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [C_N,'(',C_S,')',
           R_N,'(',R_L,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [C_N,'(',C_S,')',
           R_N,'(',R_L,')']),
                           tell(user),
                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%!  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
f:-write("Поиск страны по площади страны в пределах: (min,max)"),nl,
   write("Введите минимальную площадь страны: "),nl,
   read(Min),nl,
   write("Введите максимальную площадь страны: "),nl,
   read(Max),nl,

   format('~w~w~w~w~20|~n~n',
          ['Страна','(','площадь',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~n~n',
          ['Страна','(','площадь',')']),
   tell(user),

    find_country_C_S(C_N,Min,Max),
    страна_площадь(C_N,C_S),

                           format('~w~w~w~w~20|~n',
          [C_N,'(',C_S,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~n',
          [C_N,'(',C_S,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
g:-write("Поиск реки по названию страны"),nl,
   write("Введите название страны: "),nl,
   read(C_N),nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Река','(','длина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Река','(','длина',')']),
   tell(user),

    find_river_C_N(R_N,C_N),
    длина_реки(R_N,R_L),
    страна_площадь(C_N,C_S),

                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [C_N,'(',C_S,')',
           R_N,'(',R_L,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [C_N,'(',C_S,')',
           R_N,'(',R_L,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
h:-write("Поиск реки по площади страны в пределах: (min,max)"),nl,
   write("Введите минимальную площадь страны: "),nl,
   read(Min),nl,
   write("Введите максимальную площадь страны: "),nl,
   read(Max),nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Река','(','длина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Река','(','длина',')']),
   tell(user),

    find_river_C_S(R_N,Min,Max),
    длина_реки(R_N,R_L),
    страна_река(C_N,R_N),
    страна_площадь(C_N,C_S),

                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [C_N,'(',C_S,')',
           R_N,'(',R_L,')']),
                           tell('text.txt'),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [C_N,'(',C_S,')',
           R_N,'(',R_L,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
i:-write("Поиск реки по длине реки в пределах: (min,max)"),nl,
   write("Введите минимальную длину реки: "),nl,
   read(Min),nl,
   write("Введите максимальную длину реки: "),nl,
   read(Max),nl,

   format('~w~w~w~w~20|~n~n',
          ['Река','(','длина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~n~n',
          ['Река','(','длина',')']),
   tell(user),

    find_river_R_L(R_N,Min,Max),
    длина_реки(R_N,R_L),

                           format('~w~w~w~w~20|~n',
          [R_N,'(',R_L,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~n',
          [R_N,'(',R_L,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
j:-write("Поиск реки по названию озера"),nl,
   write("Введите название озера: "),nl,
   read(L_N),nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Озеро','(','глубина',')','Река','(','длина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Озеро','(','глубина',')','Река','(','длина',')']),
   tell(user),

    find_river_L_N(R_N,L_N),
    длина_реки(R_N,R_L),
    глубина_озера(L_N,L_D),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [L_N,'(',L_D,')',
           R_N,'(',R_L,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [L_N,'(',L_D,')',
           R_N,'(',R_L,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
k:-write("Поиск реки по глубине озера в пределах: (min,max)"),nl,
   write("Введите минимальную глубину озера: "),nl,
   read(Min),nl,
   write("Введите максимальную глубину озера: "),nl,
   read(Max),nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Озеро','(','глубина',')',
           'Река','(','длина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Озеро','(','глубина',')',
           'Река','(','длина',')']),
   tell(user),

    find_lake_L_D(L_N,Min,Max),
    find_river_L_N(R_N,L_N),
    длина_реки(R_N,R_L),
    глубина_озера(L_N,L_D),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [L_N,'(',L_D,')',
           R_N,'(',R_L,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [L_N,'(',L_D,')',
           R_N,'(',R_L,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
l:-write("Поиск озера по названию страны"),nl,
   write("Введите название страны: "),nl,
   read(C_N),nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Озеро','(','глубина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Озеро','(','глубина',')']),
   tell(user),

    find_lake_C_N(L_N,C_N),
    глубина_озера(L_N,L_D),
    страна_площадь(C_N,C_S),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
                                  [C_N,'(',C_S,')',
                                   L_N,'(',L_D,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
                                  [C_N,'(',C_S,')',
                                   L_N,'(',L_D,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
m:-write("Поиск озера по площади страны в пределах: (min,max)"),nl,
   write("Введите минимальную площадь страны: "),nl,
   read(Min),nl,
   write("Введите максимальную площадь страны: "),nl,
   read(Max),nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Озеро','(','глубина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Страна','(','площадь',')',
           'Озеро','(','глубина',')']),
   tell(user),

    find_lake_C_S(L_N,Min,Max),
    глубина_озера(L_N,L_D),
    страна_озеро(C_N,L_N),
    страна_площадь(C_N,C_S),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
                                  [C_N,'(',C_S,')',
                                   L_N,'(',L_D,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
                                  [C_N,'(',C_S,')',
                                   L_N,'(',L_D,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
n:-write("Поиск озера по глубине озера в пределах: (min,max)"),nl,
   write("Введите минимальную глубину озера: "),nl,
   read(Min),nl,
   write("Введите максимальную глубину озера: "),nl,
   read(Max),nl,

   format('~w~w~w~w~20|~n~n',
          ['Озеро','(','глубина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~n~n',
          ['Озеро','(','глубина',')']),
   tell(user),

    find_lake_L_D(L_N,Min,Max),
    глубина_озера(L_N,L_D),
                           format('~w~w~w~w~20|~n',
                                  [L_N,'(',L_D,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~n',
                                  [L_N,'(',L_D,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
o:-write("Поиск озера по названию реки"),nl,
   write("Введите название реки: "),nl,
   read(R_N),nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Озеро','(','глубина',')',
           'Река','(','длина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Озеро','(','глубина',')',
           'Река','(','длина',')']),
   tell(user),

    find_lake_R_N(L_N,R_N),
    длина_реки(R_N,R_L),
    глубина_озера(L_N,L_D),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [L_N,'(',L_D,')',
           R_N,'(',R_L,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [L_N,'(',L_D,')',
           R_N,'(',R_L,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
p:-write("Поиск озера по длине реки в пределах: (min,max)"),nl,
   write("Введите минимальную длину реки: "),nl,
   read(Min),nl,
   write("Введите максимальную длину реки: "),nl,
   read(Max),nl,

   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Озеро','(','глубина',')',
           'Река','(','длина',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~w~w~w~w~40|~n~n',
          ['Озеро','(','глубина',')',
           'Река','(','длина',')']),
   tell(user),

    find_river_R_L(R_N,Min,Max),
    find_lake_R_N(L_N,R_N),
    длина_реки(R_N,R_L),
    глубина_озера(L_N,L_D),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [L_N,'(',L_D,')',
           R_N,'(',R_L,')']),

                           tell('text.txt'),
                           format('~w~w~w~w~20|~w~w~w~w~40|~n',
          [L_N,'(',L_D,')',
           R_N,'(',R_L,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
r:-write("Сводная информация о стране по ее названию"),nl,
   write("Введите название страны:"),nl,
   read(C_N),nl,

   format('~w~w~w~w~20|~n~n',
          ['Страна','(','площадь',')']),

   tell('text.txt'),
   format('~w~w~w~w~20|~n~n',
          ['Страна','(','площадь',')']),
   tell(user),

    страна_площадь(C_N,C_S),
                          format('~w~w~w~w~20|~n',
          [C_N,'(',C_S,')']),

                           tell('text.txt'),
                          format('~w~w~w~w~20|~n',
          [C_N,'(',C_S,')']),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
s:-write("Сводная информация о реке по ее названию"),nl,
   write("Введите название реки:"),nl,
   read(R_N),nl,

   format('~w~20|~w~40|~w~60|~n~n',
          ['Страна','Река','Длина']),

   tell('text.txt'),
   format('~w~20|~w~40|~w~60|~n~n',
          ['Страна','Река','Длина']),
   tell(user),

    страна_река(C_N,R_N),
    длина_реки(R_N,R_L),

                          format('~w~20|~w~40|~w~60|~n',
          [C_N,R_N,R_L]),

                           tell('text.txt'),
                           format('~w~20|~w~40|~w~60|~n',
          [C_N,R_N,R_L]),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
t:-write("Сводная информация об озере по его названию"),nl,
   write("Введите название озера:"),nl,
   read(L_N),nl,

   format('~w~20|~w~40|~w~60|~n~n',
          ['Страна','Озеро','Глубина']),

   tell('text.txt'),
   format('~w~20|~w~40|~w~60|~n~n',
          ['Страна','Озеро','Глубина']),
   tell(user),

    страна_озеро(C_N,L_N),
    глубина_озера(L_N,L_D),

                          format('~w~20|~w~40|~w~60|~n',
          [C_N,L_N,L_D]),

                           tell('text.txt'),
                           format('~w~20|~w~40|~w~60|~n',
          [C_N,L_N,L_D]),
                           tell(user),

                           fail.
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
