#!/usr/bin/pl -q -t einstein -s
справка:-write('человек_пет(X1,Y1,X2,Y2,X3,Y3).'),nl,
         write('три_друга_на_скамье(X,Y,Z).'),nl,
         write('квест_эйнштейна.'),nl,
         write('работа(X1,R11,R12,X2,R21,R22,X3,R31,R32,X4,R41,R42).'),nl,
         write('грядки(X1,Y1,X2,Y2,X3,Y3,X4,Y4,X5,Y5,0,0).'),nl.
%//////////////////////////4.1/////////////////////////////
имя("Петя").
имя("Лена").
имя("Таня").

пет("Собака").
пет("Кошка").
пет("Хомяк").

соответствие(X,Y):-имя(X),X = "Таня",пет(Y),Y = "Кошка".
соответствие(X,Y):-имя(X),X = "Петя",пет(Y),not(Y = "Хомяк").
соответствие(X,Y):-имя(X),X = "Лена",пет(Y).

человек_пет(X1,Y1,X2,Y2,X3,Y3):-
    X1 = "Петя",соответствие(X1,Y1),
    X2 = "Таня",соответствие(X2,Y2),
    X3 = "Лена",соответствие(X3,Y3),
    Y1\=Y2, Y2\=Y3, Y1\=Y3.
%//////////////////////////4.2////////////////////////////

слева("Юра","Миша").
слева("Витя","Юра").

три_друга_на_скамье(X,Y,Z):-слева(X,Y),слева(Y,Z).
%//////////////////////////4.3////////////////////////////

neighbors1(X, Y, List) :- nextto(X, Y, List) ; nextto(Y, X, List) .

квест_эйнштейна:-
    Houses = [_,_,_,_,_],
    nth1(1, Houses, [норвежец,_,_,_,_]),
    member([англичанин,_,_,_,красный], Houses),
    nextto([_,_,_,_,зеленый], [_,_,_,_,белый], Houses),
    member([датчанин,_,_,чай,_], Houses),
    neighbors1([_,_,marlboro,_,_], [_,кошка,_,_,_], Houses),
    member([_,_,dunhill,_,желтый], Houses),
    member([немец,_,rothmans,_,_], Houses),
    nth1(3, Houses, [_,_,_,молоко,_]),
    neighbors1([_,_,marlboro,_,_], [_,_,_,вода,_], Houses),
    member([_,птица,pallmall,_,_], Houses),
    member([швед,собака,_,_,_], Houses),
    neighbors1([норвежец,_,_,_,_], [_,_,_,_,голубой], Houses),
    member([_,лошадь,_,_,голубой], Houses),
    member([_,_,winfield,пиво,_], Houses),
    member([_,_,_,кофе,зеленый], Houses),
    member([Fish,рыба,_,_,_], Houses),

    write('Кто с рыбой?: '), write(Fish), nl.

/*имя51('Роберта').
имя51('Тельма').
имя51('Стив').
имя51('Пит').

работа('руководитель').
работа('охранник').
работа('санитар').
работа('телефонист').
работа('полицейский').
работа('учитель').
работа('актер').
работа('боксер').

ктогде(X,R1,R2):-имя51(X),X = 'Роберта',работа(R1),работа(R2),
    R1\='cанитар',
    R2\='cанитар',
    R1\='боксер',
    R2\='боксер',
    R1\='руководитель',
    R2\='руководитель',
    R1\='полицейский',
    R2\='полицейский',
    R1\='телефонист',
    R2\='телефонист',
    R1\=R2.
ктогде(X,R1,R2):-имя51(X),X = 'Тельма',работа(R1),работа(R2),
    R1\='cанитар',
    R2\='cанитар',
    R1\='телефонист',
    R2\='телефонист',
    R1\=R2.
ктогде(X,R1,R2):-имя51(X),X = 'Стив',работа(R1),работа(R2),
    R1\=R2.
ктогде(X,R1,R2):-имя51(X),X = 'Пит',работа(R1),работа(R2),
    R1\='учитель',
    R2\='учитель',
    R1\='руководитель',
    R2\='руководитель',
    R1\=R2.

работа(X1,R11,R12,X2,R21,R22,X3,R31,R32,X4,R41,R42):-
    ктогде(X1,R11,R12),
    ктогде(X2,R21,R22),
    ктогде(X3,R31,R32),
    ктогде(X4,R41,R42),
    R11\=R21,R11\=R22,R11\=R31,R11\=R32,R11\=R41,R11\=R42,
    R12\=R21,R12\=R22,R12\=R31,R12\=R32,R12\=R41,R12\=R42,
    R21\=R31,R21\=R32,R21\=R41,R21\=R42,
    R22\=R31,R22\=R32,R22\=R41,R22\=R42,
    R31\=R41,R31\=R42,
    R32\=R41,R32\=R42,
    X1\=X2,X1\=X3,X1\=X4,X2\=X3,X2\=X4,X3\=X4.*/

работа('руководитель').
работа('охранник').
работа('санитар').
работа('телефонист').
работа('полицейский').
работа('учитель').
работа('актер').
работа('боксер').

работы:-
    PJ = [_,_,_,_],
    nth1(1,PJ,['жен','роберта',J1,J2]),
    nth1(2,PJ,['жен','тельма',J3,J4]),
    nth1(3,PJ,['муж','стив',J5,J6]),
    nth1(4,PJ,['муж','пит',J7,J8]),

    member(['жен',_,R1,R2],PJ),
    работа(R1),
    работа(R2),
    R1\='санитар',
    R2\='санитар',
    R1\='телефонист',
    R2\='телефонист',
    R1\=R2,

    member(['муж',_,R3,R4],PJ),
    работа(R3),
    работа(R4),
    R3\='руководитель',
    R4\='руководитель',
    R3\=R4,

    member([_,'роберта',R5,R6],PJ),
    работа(R5),
    работа(R6),
    R5\='руководитель',
    R6\='руководитель',
    R5\='полицейский',
    R6\='полицейский',
    R5\='боксер',
    R6\='боксер',
    R5\=R6,

    member([_,'пит',R7,R8],PJ),
    работа(R7),
    работа(R8),
    R7\='учитель',
    R8\='учитель',
    R7\=R8,

    J1\=J2,J1\=J3,J1\=J4,J1\=J5,J1\=J6,J1\=J7,J1\=J8,
    J2\=J3,J2\=J4,J2\=J5,J2\=J6,J2\=J7,J2\=J8,
    J3\=J4,J3\=J5,J3\=J6,J3\=J7,J3\=J8,
    J4\=J5,J4\=J6,J4\=J7,J4\=J8,
    J5\=J6,J5\=J7,J5\=J8,
    J6\=J7,J6\=J8,
    J7\=J8,
    write(PJ).


%5.2
овощ('Морковь').
овощ('Капуста').

имя5('Катя').
имя5('Егор').
имя5('Кира').
имя5('Захар').
имя5('Лера').

выбор(Y,K,M,K1,M1):-Y = 'Морковь',K1 is K, M1 is M+1.
выбор(Y,K,M,K1,M1):-Y = 'Капуста',M1 is M, K1 is K+1.

сажают(X1,Y1,X2,Y2,K,M,K2,M2):-имя5(X1),X1 = 'Катя',
                         имя5(X2),X2 = 'Егор',
                         овощ(Y1),
                         овощ(Y2),
                         Y1\=Y2,
                         выбор(Y1,K,M,K1,M1),
                         выбор(Y2,K1,M1,K2,M2).
сажают(X1,Y1,X2,Y2,K,M,K2,M2):-имя5(X1),X1 = 'Егор',
                         имя5(X2),X2 = 'Кира',
                         овощ(Y1),
                         овощ(Y2),
                         Y1\=Y2,
                         выбор(Y1,K,M,K1,M1),
                         выбор(Y2,K1,M1,K2,M2).
сажают(X1,Y1,X2,Y2,K,M,K2,M2):-имя5(X1),X1 = 'Кира',
                         имя5(X2),X2 = 'Захар',
                         овощ(Y1),
                         овощ(Y2),
                         Y1\=Y2,
                         выбор(Y1,K,M,K1,M1),
                         выбор(Y2,K1,M1,K2,M2).
сажают(X1,Y1,X2,Y2,K,M,K1,M1):-имя5(X1),X1 = 'Захар',
                         имя5(X2),X2 = 'Лера',
                         овощ(Y1),
                         овощ(Y2),
                         Y1=Y2,
                         выбор(Y1,K,M,K1,M1).
грядки(X1,Y1,X2,Y2,X3,Y3,X4,Y4,X5,Y5,K,M):-
    сажают(X1,Y1,X2,Y2,K,M,K1,M1),
    сажают(X2,Y2,X3,Y3,K1,M1,K2,M2),
    сажают(X3,Y3,X4,Y4,K2,M2,K3,M3),
    сажают(X4,Y4,X5,Y5,K3,M3,K4,M4),
    K4<4,M4<5,nl,write("где Кира?: "),write(Y3),nl,nl.


